In [1]:
import pandas as pd

In [2]:
df= pd.DataFrame([11,12,13,14,15])
df

    0
0  11
1  12
2  13
3  14
4  15

In [3]:
df1= pd.DataFrame([[12,13,15],[45,67,44]])

In [4]:
df1

    0   1   2
0  12  13  15
1  45  67  44

In [5]:
df=pd.DataFrame({'name':['Komal','Surbhi','Anmol','Rohit'],'class':['btech','Mtech','bca','bba'],'marks':[12,14,15,21]})

In [6]:
df

     name  class  marks
0   Komal  btech     12
1  Surbhi  Mtech     14
2   Anmol    bca     15
3   Rohit    bba     21

In [9]:
df1=pd.DataFrame({'name':['Komal','Surbhi','Anmol','Rohit'],'class':['btech','Mtech','bca','BBA'],'marks':[12,14,15,21]}, index=['a','b','c','d'])
df1

     name  class  marks
a   Komal  btech     12
b  Surbhi  Mtech     14
c   Anmol    bca     15
d   Rohit    BBA     21

In [12]:
df1=pd.DataFrame({'name':['Komal','Surbhi','Anmol','Rohit'],'class':['btech','Mtech','bca','BBA'],'marks':[12,14,15,21]}, index=['a','b','c','d'], columns=['name','class'])
df1

     name  class
a   Komal  btech
b  Surbhi  Mtech
c   Anmol    bca
d   Rohit    BBA

In [14]:
df2=pd.DataFrame({'name':['Komal','Surbhi','Anmol','Rohit','Hargun','Jannat'],'class':['btech','Mtech','bca','BBA','Btech','MCA'],'marks':[12,14,15,21,24,16]})
df2

     name  class  marks
0   Komal  btech     12
1  Surbhi  Mtech     14
2   Anmol    bca     15
3   Rohit    BBA     21
4  Hargun  Btech     24
5  Jannat    MCA     16

In [15]:
df3=pd.DataFrame({'name':['Komal','Surbhi','Anmol','Rohit','Hargun','Jannat'],'class':'Btech','marks':[12,14,15,21,24,16]})
df3

     name  class  marks
0   Komal  Btech     12
1  Surbhi  Btech     14
2   Anmol  Btech     15
3   Rohit  Btech     21
4  Hargun  Btech     24
5  Jannat  Btech     16

In [17]:
df2.head()

     name  class  marks
0   Komal  btech     12
1  Surbhi  Mtech     14
2   Anmol    bca     15
3   Rohit    BBA     21
4  Hargun  Btech     24

In [18]:
df2.tail()

     name  class  marks
1  Surbhi  Mtech     14
2   Anmol    bca     15
3   Rohit    BBA     21
4  Hargun  Btech     24
5  Jannat    MCA     16

In [19]:
df2['name']

0     Komal
1    Surbhi
2     Anmol
3     Rohit
4    Hargun
5    Jannat
Name: name, dtype: object

In [23]:
df2[['name','class']]

     name  class
0   Komal  btech
1  Surbhi  Mtech
2   Anmol    bca
3   Rohit    BBA
4  Hargun  Btech
5  Jannat    MCA

In [26]:
df2.marks

0    12
1    14
2    15
3    21
4    24
5    16
Name: marks, dtype: int64

In [29]:
df2['name'][:2]

0     Komal
1    Surbhi
Name: name, dtype: object

In [30]:
df2['marks'][3]

21

In [31]:
#conditions

In [32]:
df2

     name  class  marks
0   Komal  btech     12
1  Surbhi  Mtech     14
2   Anmol    bca     15
3   Rohit    BBA     21
4  Hargun  Btech     24
5  Jannat    MCA     16

In [41]:
df2[df2['name']=='Hargun']

     name  class  marks
4  Hargun  Btech     24

In [45]:
df2[(df2['name']=='Hargun')& (df2['class']=='btech')]

Empty DataFrame
Columns: [name, class, marks]
Index: []

In [46]:
# loc, iloc

In [47]:
df2.loc[:,:]

     name  class  marks
0   Komal  btech     12
1  Surbhi  Mtech     14
2   Anmol    bca     15
3   Rohit    BBA     21
4  Hargun  Btech     24
5  Jannat    MCA     16

In [48]:
df2.loc[:,'name']

0     Komal
1    Surbhi
2     Anmol
3     Rohit
4    Hargun
5    Jannat
Name: name, dtype: object

In [49]:
df2.loc[:,['name','class']]

     name  class
0   Komal  btech
1  Surbhi  Mtech
2   Anmol    bca
3   Rohit    BBA
4  Hargun  Btech
5  Jannat    MCA

In [54]:
df2.loc[:2,['name']]

     name
0   Komal
1  Surbhi
2   Anmol

In [58]:
df2.iloc[:,2]

0    12
1    14
2    15
3    21
4    24
5    16
Name: marks, dtype: int64

In [61]:
df2.iloc[:,:2]

     name  class
0   Komal  btech
1  Surbhi  Mtech
2   Anmol    bca
3   Rohit    BBA
4  Hargun  Btech
5  Jannat    MCA

In [62]:
df2.loc[2,'name']='Vishal'

In [63]:
df2

     name  class  marks
0   Komal  btech     12
1  Surbhi  Mtech     14
2  Vishal    bca     15
3   Rohit    BBA     21
4  Hargun  Btech     24
5  Jannat    MCA     16

In [65]:
df2.loc[:,'rollno']=[11,12,13,14,14,16]
df2

     name  class  marks  rollno
0   Komal  btech     12      11
1  Surbhi  Mtech     14      12
2  Vishal    bca     15      13
3   Rohit    BBA     21      14
4  Hargun  Btech     24      14
5  Jannat    MCA     16      16

In [66]:
df2.loc[:,'percentage']= (df2.loc[:,'marks']/25) *100

In [67]:
df2

     name  class  marks  rollno  percentage
0   Komal  btech     12      11        48.0
1  Surbhi  Mtech     14      12        56.0
2  Vishal    bca     15      13        60.0
3   Rohit    BBA     21      14        84.0
4  Hargun  Btech     24      14        96.0
5  Jannat    MCA     16      16        64.0

In [72]:
df2.drop('rollno', axis=1, inplace=True)  # axis=0  row, axis=1 columns

In [73]:
df2

     name  class  marks  percentage
0   Komal  btech     12        48.0
1  Surbhi  Mtech     14        56.0
2  Vishal    bca     15        60.0
3   Rohit    BBA     21        84.0
4  Hargun  Btech     24        96.0
5  Jannat    MCA     16        64.0